src_ext/Documents/УЗ_ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПриходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_ПеремещениеДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПеремещениеДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбученияОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделатьДвиженияПоВзаиморасчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбученияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/CommonForms/УЗ_ФормаОтчета/Ext/Form/Module.bsl
// Своя форма отчетов УЗ на СКД — без БСП.
//
// Формирование, варианты (выбор/сохранение в хранилище платформы), пользовательские настройки
// и стандартная расшифровка — механизмы самой платформы: форма объявлена формой отчета
// (Результат, ДанныеРасшифровки, ГруппаБыстрыеНастройки в свойствах формы).
// Стандартные «Настройки...» и «Изменить вариант...» отключены: у хозяина (УНФ/БП/УТ) формы
// настроек и варианта по умолчанию — из БСП; вместо них своя панель «Настройки...» на этой форме.
//
// «Оформить приход денег» и «Оформить перемещение денег» (было патчем формы БСП в LM)
// видны только у отчета Взаиморасчеты: ученик и предмет берутся из расшифровки текущей ячейки,
// иначе из отбора отчета; сумма — из текста ячейки (долг в отчете отрицательный).

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяОтчета = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	КомандыКассы = (ИмяОтчета = "УЗ_Взаиморасчеты");
	Элементы.ФормаОформитьПКО.Видимость = КомандыКассы;
	Элементы.ФормаОформитьПеремещениеДенег.Видимость = КомандыКассы;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьНастройки(Команда)

	Показывать = НЕ Элементы.ГруппаНастройки.Видимость;
	Элементы.ГруппаНастройки.Видимость = Показывать;
	Элементы.ФормаПоказатьНастройки.Пометка = Показывать;

КонецПроцедуры

&НаКлиенте
Процедура ОформитьПКО(Команда)

	Ячейка = ДанныеТекущейЯчейки();
	ЗначенияЗаполнения = ЗначенияЗаполненияДокумента("УЗ_ПриходДенег", Ячейка.Расшифровка, Ячейка.Текст);
	ОткрытьФорму("Документ.УЗ_ПриходДенег.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОформитьПеремещениеДенег(Команда)

	Ячейка = ДанныеТекущейЯчейки();
	ЗначенияЗаполнения = ЗначенияЗаполненияДокумента("УЗ_ПеремещениеДенег", Ячейка.Расшифровка, Ячейка.Текст);
	ОткрытьФорму("Документ.УЗ_ПеремещениеДенег.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ДанныеТекущейЯчейки()

	Ячейка = Новый Структура("Расшифровка, Текст", Неопределено, "");
	Попытка
		Область = Элементы.Результат.ТекущаяОбласть;
		Ячейка.Текст = Область.Текст;
		Ячейка.Расшифровка = Область.Расшифровка;
	Исключение
		// не ячейка (рисунок, диаграмма) — заполним из отбора
	КонецПопытки;
	Возврат Ячейка;

КонецФункции

&НаСервере
Функция ЗначенияЗаполненияДокумента(ИмяДокумента, Знач Расшифровка, Знач ТекстЯчейки)

	Поля = Новый Соответствие;
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных")
		И ЭтоАдресВременногоХранилища(ДанныеРасшифровки) Тогда
		ДанныеОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
		Если ТипЗнч(ДанныеОтчета) = Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда
			ДобавитьПоляРасшифровки(ДанныеОтчета.Элементы[Расшифровка], Поля);
		КонецЕсли;
	КонецЕсли;
	ДобавитьПоляОтбора(Отчет.КомпоновщикНастроек.ПолучитьНастройки().Отбор.Элементы, Поля);

	Клиент = Поля.Получить("Клиент");
	Предмет = Поля.Получить("ПредметОбучения");
	Сумма = ЧислоИзТекста(ТекстЯчейки);
	Если Сумма < 0 Тогда
		Сумма = -Сумма;
	КонецЕсли;

	Заполнение = Новый Структура;
	Если ИмяДокумента = "УЗ_ПриходДенег" Тогда
		Если ТипЗнч(Клиент) = Тип("СправочникСсылка.УЗ_ФизЛица") И ЗначениеЗаполнено(Клиент) Тогда
			Заполнение.Вставить("ФизЛицо", Клиент);
			Заполнение.Вставить("Родитель", Клиент.Родитель1);
		КонецЕсли;
		Если ЗначениеЗаполнено(Предмет) Тогда
			Заполнение.Вставить("ПредметОбучения", Предмет);
		КонецЕсли;
		Если Сумма > 0 Тогда
			Заполнение.Вставить("СуммаДокумента", Сумма);
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Клиент) Тогда
			Заполнение.Вставить("Клиент", Клиент);
		КонецЕсли;
		Если ЗначениеЗаполнено(Предмет) Тогда
			Заполнение.Вставить("ПредметОбученияОтправитель", Предмет);
		КонецЕсли;
		Если Сумма > 0 Тогда
			Заполнение.Вставить("Сумма", Сумма);
		КонецЕсли;
	КонецЕсли;
	Возврат Заполнение;

КонецФункции

// Поля ячейки и всех ее родителей (группировок) в расшифровке; ближайшее значение важнее.
&НаСервереБезКонтекста
Процедура ДобавитьПоляРасшифровки(ЭлементРасшифровки, Поля)

	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Для Каждого ЗначениеПоля Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			Если Поля.Получить(ЗначениеПоля.Поле) = Неопределено Тогда
				Поля.Вставить(ЗначениеПоля.Поле, ЗначениеПоля.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Для Каждого Родитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
		ДобавитьПоляРасшифровки(Родитель, Поля);
	КонецЦикла;

КонецПроцедуры

// Включенные отборы «Равно» (вариант + пользовательские настройки) — если в ячейке поля не было.
&НаСервереБезКонтекста
Процедура ДобавитьПоляОтбора(ЭлементыОтбора, Поля)

	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ДобавитьПоляОтбора(ЭлементОтбора.Элементы, Поля);
			Продолжить;
		КонецЕсли;
		Если ЭлементОтбора.ВидСравнения <> ВидСравненияКомпоновкиДанных.Равно Тогда
			Продолжить;
		КонецЕсли;
		ИмяПоля = Строка(ЭлементОтбора.ЛевоеЗначение);
		Если Поля.Получить(ИмяПоля) = Неопределено Тогда
			Поля.Вставить(ИмяПоля, ЭлементОтбора.ПравоеЗначение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЧислоИзТекста(Знач Текст)

	Текст = СтрЗаменить(Текст, " ", "");
	Текст = СтрЗаменить(Текст, Символы.НПП, "");
	Текст = СтрЗаменить(Текст, ",", ".");
	Попытка
		Возврат Число(Текст);
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции

#КонецОбласти
